Repository: CESI-Genie-logiciel-G4/EasySave
Catalog: src/EasySave/Resources/Globalization/Strings.*.resx
Languages: fr

# MenuExecuteJobs
source: Execute one or more jobs
fr: Exécuter un ou plusieurs travaux

# MenuAddJob
source: Add a new job
fr: Ajouter un nouveau travail

# MenuRemoveJob
source: Remove a job
fr: Supprimer un travail

# MenuExit
source: Exit
fr: Quitter

source: No jobs available
fr: Aucun travail disponible

source: Jobs available:
fr: Travaux disponibles :

# SelectOption
source: Select an option
fr: Sélectionnez une option

# SelectJobsToExecute
source: Select the jobs to execute
fr: Sélectionnez les travaux à exécuter

# SelectJobToRemove
source: Select the job to remove
fr: Sélectionnez le travail à supprimer

# EnterJobName
source: Enter the name of the job
fr: Entrez le nom du travail

# JobExecuted
source: Backup [{0}] completed successfully
fr: Sauvegarde [{0}] executée avec succès

# JobAdded
source: Job {0} added
fr: Travail {0} ajouté

# JobRemoved
source: Job N°{0} removed
fr: Travail N°{0} supprimé

source: Exiting...
fr: Fermeture en cours...

# PressAnyKey
source: - Press any key to continue -
fr: - Appuyez sur une touche pour continuer -

# InvalidInput
source: Invalid input, please try again.
fr: Entrée invalide, veuillez réessayer.

# SelectLanguage
source: Select a language
fr: Sélectionnez une langue

source: French
fr: Français

source: English
fr: Anglais

# MenuChangeLanguage
source: Change language
fr: Changer la langue

# StringLengthRange
source: ({0}-{1} characters):
fr: ({0}-{1} caractères) :

# InvalidStringLength
source: Please enter a valid string.
fr: Veuillez entrer une chaîne de caractères valide.

# InvalidStringList
source: Please enter at least one valid extension (.txt, .jpg, .png, etc.).
fr: Veuillez entrer au moins une extension valide (.txt, .jpg, .png, etc.).

# InvalidBoolean
source: Please enter a valid boolean value (y/n).
fr: Veuillez entrer une valeur booléenne valide (y/n).

# InvalidNumber
source: Please enter a valid number.
fr: Veuillez entrer un nombre valide.

# InvalidFormat
source: Invalid format. Try: 5, 2-5, 1;3;7, *.
fr: Format invalide. Essayez: 5, 2-5, 1;3;7, *.

# ExitToCancel
source: '{0}' to cancel
fr: '{0}' pour annuler

# EnterDestinationDirectory
source: Enter the destination directory
fr: Entrer le répertoire de destination

# EnterSourceDirectory
source: Enter the source directory
fr: Entrer le répertoire source

source: Invalid directory
fr: Répertoire invalide

source: Select backup type
fr: Sélectionner le type de sauvegarde

source: Job limit reached
fr: Limite de tâches atteinte

source: Source Path
fr: Chemin source

source: Name
fr: Nom

# FullBackup
source: Full
fr: Complète

# DifferentialBackup
source: Differential
fr: Différentielle

source: Destination Path
fr: Chemin de destination

# MenuEncryptedExtensions
source: Define encrypted extensions
fr: Définir extensions chiffrées

# MenuAddExtension
source: Add extension
fr: Ajouter une extension

# MenuRemoveExtension
source: Remove extension
fr: Supprimer une extension

# MenuReturn
source: Return
fr: Retour

source: Encryption
fr: Chiffrement

source: Encrypted extensions
fr: Extensions chiffrées

source: Use encryption ?
fr: Utiliser le chiffrement ?

# EnterEncryptedExtensions
source: Enter the encrypted extensions (separated by commas)
fr: Entrez les extensions à chiffrer (séparées par des virgules)

source: Current encrypted extensions
fr: Extensions chiffrées actuelles

source: No extensions available
fr: Aucune extension disponible

# SelectExtensionToRemove
source: Select the extension to remove
fr: Sélectionnez l'extension à supprimer

# EnterNewExtensions
source: Enter the new extensions (separated by commas)
fr: Entrez les nouvelles extensions (séparées par des virgules)

source: Extension already exists
fr: Extension déjà existante

# EncryptedExtensionsChanged
source: New list of encrypted extensions
fr: Nouvelle liste d'extensions à chiffrer

source: Extension added :
fr: Extension ajoutée :

source: Extension removed :
fr: Extension supprimée :

source: Progress:
fr: Progression :

source: Unauthorized Access
fr: Accès non autorisé

# ErrorOccurred
source: An error occurred
fr: Une erreur c'est produite

source: Directory Not Found
fr: Répertoire non trouvé

# StartBackupJob
source: Starting Job:
fr: Execution de :

source: Check logs
fr: Vérifiez les logs

# IOError
source: Input/Output Error
fr: Erreur d'entrée/sortie

# SyntheticFullBackup
source: Synthetic Full
fr: Complète synthétique

# MenuLogsFormat
source: Change log format
fr: Changer format des Logs

# SelectLogsTransporters
source: Select the desired log output formats to enable/disable
fr: Sélectionnez les formats de sortie de logs à activer/désactiver

# LogsFormatChanged
source: The log formats have been successfully changed
fr: Les formats de logs ont été modifiés avec succès

# AvailableLogsFormats
source: Available log output formats:
fr: Formats de sortie des logs disponibles :

# CryptoError
source: Error during encryption/decryption
fr: Erreur lors du chiffrement/déchiffrement

# UiType_Gui
source: Launches the graphical UI
fr: Lance l'interface graphique

# UiType_Console
source: Launches the console UI
fr: Lance le mode console

source: Usage:
fr: Utilisation :

source: Invalid UI type.
fr: Type d'interface invalide.

source: Available modes:
fr: Modes disponibles :
